; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-10)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 )
(:init
(arm-empty)
(on-table b1)
(on-table b2)
(on b3 b2)
(on-table b4)
(on b5 b7)
(on b6 b5)
(on-table b7)
(on-table b8)
(on-table b9)
(on-table b10)
(clear b1)
(clear b3)
(clear b4)
(clear b6)
(clear b8)
(clear b9)
(clear b10)
)
(:goal
(and
(on b1 b10)
(on b3 b8)
(on b6 b3)
(on b8 b4)
(on b9 b1)
(on b10 b5))
)
)

; plan
1. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 0 of 6
2. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 1 of 6
3. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 1 of 6
4. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 2 of 6
5. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 2 of 6
6. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 3 of 6
7. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 3 of 6
8. (stack b10 b5)
   deleted: (clear b5) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b5)
   goals met: 4 of 6
9. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 4 of 6
10. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 5 of 6
11. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 5 of 6
12. (stack b9 b1)
   deleted: (clear b1) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b1)
   goals met: 6 of 6
